
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Не ЗначениеЗаполнено(Объект.Документы) Тогда
		Для Каждого МетаданныеДокумент Из Метаданные.Документы Цикл
			НоваяСтрока = Объект.Документы.Добавить();
			НоваяСтрока.Документ = МетаданныеДокумент.Имя;
		КонецЦикла;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.КоличествоДнейДоНачалаПериодаОбрабатываемыхДокументов = 7;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	МассивУдаляемыхСтрок = Новый Массив;
	Для Каждого СтрТаб Из Объект.Документы Цикл
		Если Не СтрТаб.Использовать ИЛИ Не ЗначениеЗаполнено(СтрТаб.Документ) Тогда
			МассивУдаляемыхСтрок.Добавить(СтрТаб);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрТаб Из МассивУдаляемыхСтрок Цикл
		Объект.Документы.Удалить(СтрТаб);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрыРеквизитДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СписокРеквизитов = ПролучитьСписокРеквизитов();
	Элементы.ФильтрыРеквизитДокумента.РежимВыбораИзСписка = Истина;
	Элементы.ФильтрыРеквизитДокумента.СписокВыбора.ЗагрузитьЗначения(СписокРеквизитов);
	Элементы.ФильтрыРеквизитДокумента.СписокВыбора.СортироватьПоЗначению();
КонецПроцедуры

&НаСервере
Функция ПролучитьСписокРеквизитов()
	СписокРеквизитов = Новый Массив;
	Для Каждого СтрТаб Из Объект.Документы Цикл
		Если Не СтрТаб.Использовать Тогда 
			Продолжить;
		КонецЕсли;
		ИмяДокумента = СокрЛП(СтрТаб.Документ);
		Реквизиты = Метаданные.Документы[ИмяДокумента].Реквизиты;
		Для Каждого Реквизит Из Реквизиты Цикл
			ИмяРеквизита = Реквизит.Имя;
			Если СписокРеквизитов.Найти(ИмяРеквизита) = Неопределено Тогда
				СписокРеквизитов.Добавить(ИмяРеквизита);
			КонецЕсли;
		КонецЦикла;
		Реквизиты = Метаданные.Документы[ИмяДокумента].СтандартныеРеквизиты;
		Для Каждого Реквизит Из Реквизиты Цикл
			ИмяРеквизита = Реквизит.Имя;
			Если СписокРеквизитов.Найти(ИмяРеквизита) = Неопределено Тогда
				СписокРеквизитов.Добавить(ИмяРеквизита);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат СписокРеквизитов;
КонецФункции

&НаСервере
Функция ПолучитьТипРеквизита(ИмяРеквизита)
	ТипРеквизита = Неопределено;
	Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
		Для Каждого СтрТаб Из Объект.Документы Цикл
			ИмяДокумента = СокрЛП(СтрТаб.Документ);
			Реквизит = Метаданные.Документы[ИмяДокумента].Реквизиты.Найти(ИмяРеквизита);
			Если Не Реквизит = Неопределено Тогда
				ТипРеквизита = Реквизит.Тип;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат ТипРеквизита;
КонецФункции

&НаКлиенте
Процедура ФильтрыРеквизитДокументаПриИзменении(Элемент)
	Элементы.Фильтры.ТекущиеДанные.Значение = Неопределено;
	Элементы.Фильтры.ТекущиеДанные.ВидСравнения = ПредопределенноеЗначение("Перечисление.ВидыСравненияСозданияБизнесПроцессов.Равно");
	ИмяРеквизита = Элементы.Фильтры.ТекущиеДанные.РеквизитДокумента;
	ТипРеквизита = ПолучитьТипРеквизита(ИмяРеквизита);
	Если ЗначениеЗаполнено(ТипРеквизита) Тогда
		Элементы.ФильтрыЗначение.ОграничениеТипа = Новый ОписаниеТипов(ТипРеквизита);
		Элементы.ФильтрыЗначение.ВыбиратьТип = Истина;
	Иначе
		Если ИмяРеквизита = "Дата" Тогда
			Элементы.ФильтрыЗначение.ОграничениеТипа = Новый ОписаниеТипов("Дата");
			Элементы.ФильтрыЗначение.ВыбиратьТип = Ложь;
		ИначеЕсли ИмяРеквизита = "Номер" Тогда
			Элементы.ФильтрыЗначение.ОграничениеТипа = Новый ОписаниеТипов("Строка");
			Элементы.ФильтрыЗначение.ВыбиратьТип = Ложь;
		ИначеЕсли ИмяРеквизита = "ПометкаУдаления" Тогда
			Элементы.ФильтрыЗначение.ОграничениеТипа = Новый ОписаниеТипов("Булево");
			Элементы.ФильтрыЗначение.ВыбиратьТип = Ложь;
		ИначеЕсли ИмяРеквизита = "Проведен" Тогда
			Элементы.ФильтрыЗначение.ОграничениеТипа = Новый ОписаниеТипов("Булево");
			Элементы.ФильтрыЗначение.ВыбиратьТип = Ложь;			
		Иначе
			Элементы.ФильтрыЗначение.ОграничениеТипа = Новый ОписаниеТипов("");
			Элементы.ФильтрыЗначение.ВыбиратьТип = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрыВидСравненияПриИзменении(Элемент)
	
	Если Элементы.Фильтры.ТекущиеДанные.ВидСравнения = ПредопределенноеЗначение("Перечисление.ВидыСравненияСозданияБизнесПроцессов.Модифицирован") Тогда 
		Элементы.ФильтрыЗначение.ОграничениеТипа = Новый ОписаниеТипов("Строка");
		Элементы.ФильтрыЗначение.ВыбиратьТип = Ложь;
		Элементы.Фильтры.ТекущиеДанные.Значение = "Создание бизнес-процесса при изменении значения реквизита!";
	КонецЕсли;
		
КонецПроцедуры

